[
    {
      "URL": "https://safe-easy-online.com/order-lasix-online-en.html",
      "Categories": "Bestsellers",
      "Discount price1": "$0.80 per pill",
      "Discount price2": "$0.63 per pill",
      "Discount price3": "$0.53 per pill",
      "Discount price4": "$0.44 per pill",
      "Discount price5": "$0.40 per pill",
      "Gross price1": "$28.79",
      "Gross price2": "$45.59",
      "Gross price3": "$57.59",
      "Gross price4": "$63.59",
      "Gross price5": "$86.39",
      "Name": "Generic Lasix (Furosemide)",
      "no of packs1": "30pills",
      "no of packs2": "60pills",
      "no of packs3": "90pills",
      "no of packs4": "120pills",
      "no of packs5": "180pills",
      "Original price1": "$23.99",
      "Original Price2": "$37.99",
      "Original price3": "$47.99",
      "Original price4": "$52.99",
      "Original price5": "$71.99",
      "packaging": "40mg",
      "Uses": "Lasix belongs to a class of diuretics, it is prescribed in patients with swelling caused by congestive heart failure.",
      "PRODUCT DESCRIPTION": "Common Uses:\nFurosemide is a loop diuretic known for its rapid and short-term diuretic effects. It functions by inducing a natriuretic effect while reducing chloride levels in the blood. Additionally, it enhances the excretion of potassium, calcium, and magnesium. By obstructing the re-absorption of sodium and chloride in the ascending thick limb of Henle's loop within the renal tubule, it promotes increased excretion of sodium, leading to subsequent water excretion. Simultaneously, it augments potassium secretion in the distal part of the renal tubule, along with increased excretion of calcium and magnesium. Furosemide finds application in the treatment of edema syndrome associated with chronic heart failure (degree II and III), cirrhosis, renal diseases, acute heart failure (pulmonary edema), brain edema, hypertensive crisis, arterial hypertension, among other conditions.\nDosage and Direction:\nAdminister as directed by your physician.\nPrecautions:\nPrior to using Furosemide, consult your healthcare provider if you have a history of kidney disease, liver disease, gout, lupus, diabetes, or an allergy to sulfa drugs. Avoid dehydration as Furosemide increases urination. Do not discontinue medication without consulting your doctor, even if you feel well, as high blood pressure can be asymptomatic. Refrain from using Furosemide during pregnancy or breastfeeding.\nContraindications:\nFurosemide is contraindicated in cases of hypersensitivity, acute kidney failure with anuria, severe liver failure, liver coma and precoma, urethral stenosis, acute glomerulonephritis, urinary tract obstruction, hyperglycemic coma, gout, arterial hypotension, heart attack, pancreatitis, among others.\nPossible Side Effects:\nSeek medical attention if you experience signs of allergy or any of the following conditions: dry mouth, thirst, nausea, vomiting; weakness, drowsiness, restlessness, light-headedness, rapid or irregular heartbeat, muscle pain, decreased urination or absence of urination, easy bruising or bleeding, red blistering skin rash, hair loss.\nDrug Interactions:\nFurosemide may lead to hearing damage when administered alongside aminoglycoside antibiotics (e.g., gentamicin) or Edecrin, another diuretic. Concurrent use with aspirin can result in elevated blood levels of aspirin and aspirin toxicity. Furosemide can reduce lithium excretion by the kidneys. Sucralfate (Carafate) diminishes the effectiveness of Furosemide. Administration of Furosemide and Sucralfate should be spaced two hours apart.\nMissed Dose:\nIf Furosemide is taken regularly and a dose is missed, take it as soon as remembered. Skip the missed dose if it is nearly time for the next dose. Avoid compensating for a missed dose by taking an extra one.\nOverdose:\nSeek immediate medical attention if experiencing loss of appetite, ringing in the ears, severe weakness, dizziness, confusion, lightheadedness, or fainting.\nStorage:\nStore at room temperature in a dry, dark place, away from children.\nDisclaimer:\nThis information serves as general guidance and does not encompass all possible directions, drug interactions, or precautions. It should not be used for self-treatment or self-diagnosis. Any specific instructions for an individual patient should be discussed with a healthcare professional. We disclaim reliability and are not liable for any direct, indirect, special, or other damages resulting from the use of this information or its consequences on self-treatment."
    }
]